/****************************************************************************/
/*                                                                          */
/*  ファイル名  ： Log.h                                                    */
/*                                                                          */
/*  説明        ： ログ出力関連                                             */
/*                                                                          */
/****************************************************************************/

#ifndef LOG_H
#define LOG_H

/****************************************************************************/
/*  インクルード                                                            */
/****************************************************************************/


/****************************************************************************/
/*  デファイン                                                              */
/****************************************************************************/
//LOG出力 ---------------------------------------------------------->
//○ ・・・ 必要な時にONすること.
//● ・・・ 常にONしていても問題ない.
//          (その機能が使用される時のみログが出力されるため)
//▲ ・・・ 常にONしていても問題ないが、特殊な処理が入っている.
#define D_LOG00                 1                   //● Main               :起動ログ.
#define D_LOG01                 1                   //● MusicManager       :音楽ファイル選択ログ.
#define D_LOG02                 0                   //
#define D_LOG03                 0                   //.
#define D_LOG04                 0                   //.
#define D_LOG05                 1                   //● WaveFileAnalyzer   :Waveファイル解析ログ.
#define D_LOG06                 1                   //○ WaveFileAnalyzer   :Waveファイル再生ログ.
#define D_LOG07                 0                   //.
#define D_LOG08                 1                   //○ USB                :USB通常ログ.
#define D_LOG09                 0                   //○ USB                :USBエラーログ.
#define D_LOG10                 1                   //○ USB                :USB書き込みテスト.
#define D_LOG99                 1                   //● アプリ全体         :エラーログ.
//------------------------------------------------------------------<

#if D_LOG00
#define LOG_SIZE                MAX_PATH

static char                     g_cLog[LOG_SIZE];
#endif

#endif //LOG_H
